//=============================================================================
//
//  スプライトコンポーネントマネージャー [Manager_Sprite.h]
//  Date   : 2021/11/03
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include <list>

//=============================================================================
// クラス定義
//=============================================================================
class Manager_Sprite
{
private:

	//スプライトコンポーネントリスト
	std::list<class Component_Sprite*>m_ComponentList;

public:

	//スプライトコンポーネントリスト登録
	void AddComponent(class Component_Sprite* _add);

	//描画
	void Draw();  

	//終了
	void Uninit();

};
