//=============================================================================
//
//  ビルボードコンポーネントマネージャー [Manager_Billboard.h]
//  Date   : 2021/11/03
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include <unordered_map>

//=============================================================================
// クラス定義
//=============================================================================
class Manager_Billboard
{
private:

	//ビルボードコンポーネントリスト
	std::list<class Component_Billboard*>m_ComponentList;

public:

	//ビルボードコンポーネントリスト登録
	void AddComponent(class Component_Billboard* _add);

	//描画
	void Draw();

	//終了
	void Uninit();

};
