//=============================================================================
//
//  ゴールクラス [Goal.h]
//  Date   : 2021/1/25
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include "../Base/Actor3D.h"

//=============================================================================
// クラス宣言
//=============================================================================
class Goal : public Actor3D
{
private:

	//コンポーネント
	class Component_OBB*        m_Component_OBB;	    //OBBコンポーネント


	//プレイヤーコントローラーキャッシュ
	class PC_Game*    m_PlayerConroller;

public:

	//初期化・更新・終了
	virtual void Init()override;
	virtual void Update()override;
	virtual void Uninit()override;

};