//=============================================================================
//
//  落ちる床クラス [FallFloor.h]
//  Date   : 2021/1/24
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include "Cube_LD.h"

//=============================================================================
// クラス宣言
//=============================================================================
class FallFloor : public Cube_LD
{
private:

	//乗り判定用OBBコンポーネント
	class Component_OBB*    m_ON_Judge;

	//クールタイム
	int m_CoolTime;

	//キャッシュした座標
	Vector3 m_Positioncache;

public:

	//リソース読み込み・削除
	static void Load();
	static void Unload();

	//初期化・更新
	void Init()override;
	void Update()override;

};