//=============================================================================
//
//  時間系処理　[Time.cpp]
//  Date  :     2021/1/31
//
//=============================================================================
//=============================================================================
// インクルード
//=============================================================================
#include "Main.h"
#include <time.h>
#include "Time.h"
#include "Exchanger.h"

//=============================================================================
// 現在の時間取得関数
//=============================================================================
int Time::GetCurrentHour()
{
	time_t now = time(nullptr);
	struct tm* pnow = localtime(&now);
	return pnow->tm_hour;
}

//=============================================================================
// 現在の分取得関数
//=============================================================================
int Time::GetCurrentMinute()
{
	time_t now = time(nullptr);
	struct tm* pnow = localtime(&now);
	return pnow->tm_min;
}

//=============================================================================
// 現在の秒取得関数
//=============================================================================
int Time::GetCurrentSecond()
{
	time_t now = time(nullptr);
	struct tm* pnow = localtime(&now);
	return pnow->tm_sec;
}

//=============================================================================
// 現在のミリ秒取得関数
//=============================================================================
double Time::GetMilliSecond()
{
	time_t now = time(nullptr);
	return now * 0.000001;
}

//=============================================================================
// 現在時間を文字列で取得する関数
//=============================================================================
std::string Time::GetCurrentHourString()
{
	time_t now = time(nullptr);
	struct tm* pnow = localtime(&now);
	return Exchanger::INT_TO_STRING(pnow->tm_hour);
}

//=============================================================================
// 現在の分を文字列で取得する関数
//=============================================================================
std::string Time::GetCurrentMinuteString()
{
	time_t now = time(nullptr);
	struct tm* pnow = localtime(&now);
	return Exchanger::INT_TO_STRING(pnow->tm_min);
}

//=============================================================================
// 現在の秒を文字列で取得する関数
//=============================================================================
std::string Time::GetCurrentSecondString()
{
	time_t now = time(nullptr);
	struct tm* pnow = localtime(&now);
	return Exchanger::INT_TO_STRING(pnow->tm_sec);
}