//=============================================================================
//
//  服サウンドクラス [Cloth.h]
//  Date   : 2021/1/23
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include <vector>

//=============================================================================
// クラス定義
//=============================================================================
class Cloth
{
private:

	//服の音配列
	std::vector<const char*> m_ClothSounds;     

	//アクセサリ音配列
	std::vector<const char*> m_ClothSoundsMetal;

public:

	//リソース読み込み・解放
	static void Load();
	static void Unload();

	//初期化・終了
	void Init();
	void Uninit();

	//服音配列
	void PlayClothSound();

	//アクセサリ音配列再生
	void PlaySoundsMetal();

};