//=============================================================================
//
//  足音サウンドクラス [FootStep.h]
//  Date   : 2021/1/21
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include <vector>
#include "../Manager/Manager_Drawer/Manager_OBB.h"

//=============================================================================
// クラス定義
//=============================================================================
class FootStep
{
private:

	//足音配列
	std::vector<const char*> m_FootStepes[MAX_PM_TYPE];

public:

	//リソース読み込み・解放
	static void Load();
	static void Unload();

	//初期化・終了
	void Init();
	void Uninit();

	//足音再生(引数は床の材質)
	void Play(int _physicsMaterial);

};