//=============================================================================
//
//  キャラクタージャンプ開始状態 [CharacterState_Jump_Start.h]
//  Date   : 2021/11/28
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include "Base/CharacterState.h"

//=============================================================================
// クラス宣言
//=============================================================================
class CharacterState_Jump_Start : public CharacterState
{
public:

	//初期化・更新・終了
	void Init(Character* _owner)override;
	void Update()override;
	void Uninit()override;

	//ジャンプ不可
	void Jump()override {};

};