//=============================================================================
//
//  キャラクター落下状態 [CharacterState_Fall.h]
//  Date   : 2021/11/28
//
//=============================================================================
#pragma once

//=============================================================================
// インクルード
//=============================================================================
#include "Base/CharacterState.h"

//=============================================================================
// クラス定義
//=============================================================================
class CharacterState_Fall : public CharacterState
{
private:

	//ジャンプ中の移動速度をキャッシュ
	float m_KeepVelocity;

	//スプリントフラグ
	bool  m_Sprint;     

public:

	//初期化・更新・終了
	void Init(Character* _owner)override;
	void Update()override;
	void Uninit()override;

	//スプリントのキーが押されているかどうかを確認
	void Sprint(bool _input)override;

	//ジャンプ不可
	void Jump()override {};

};